tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "ffmpeg"
brew "fish"
brew "flyctl"
brew "jq"
brew "neovim"
brew "node"
brew "postgresql@14"
brew "ripgrep"
brew "tmux"
brew "yt-dlp"

cask "alfred"
cask "cron"
cask "discord"
cask "dropbox"
cask "figma"
cask "google-chrome"
cask "iterm2"
cask "spotify"
cask "telegram"
cask "whatsapp"
cask "zoom"
cask "tableplus"
cask "visual-studio-code"
cask "cursor"
cask "rectangle"
cask "slack"

vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dtoplak.vscode-glsllint"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "Gruntfuggly.todo-tree"
vscode "mquandalle.graphql"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "pmneo.tsimporter"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
